[{"description":"This design capitalizes on to-the point information, where the user sees a list of courses scheduled to take each semester and can modify those lists as needed. The users, particularly Sara, want to see all four semesters at once so that they feel the comfort of knowing that they are on track to graduate. However, when exploring the space with our paper prototype, we learned the importance of a visualization of that plan, which this design does not adequately convey.  Thus, we kept the simple list-view as a sidebar and added a visualization to our final design.",
"caption":"Design #1: Inspired by Teux Deux",
"url":"portfolio1.JPG"},
{"description":"Playing with the visual aspects of design, this drawing shows requirements and prerequisites as a series of nodes on a tree, conveying whether or not the user has taken a course by the fill of the node. Our users, particularly Francis, need to know if they are on track to graduate and primarily register for courses based on this need. Since this design is a simple and visual way to view progress on requirements and toward graduation, it meets the needs of Francis. We ultimately decided against this design because the visualization was too confusing without text.",
"caption":"Design #2: Nodes on Trees",
"url":"portfolio2.JPG"},
{"description":"This design focuses on the social atmosphere and group planning that is so common at Olin - students can view the proposed schedules of their friends and classmates to get a feel for what their own schedule should (or could) look like. Users such as Sara and Francis like to ask other people which courses they should take in a semester; Sara asks because she treats course planning as a fun social experience and Francis asks because he wants to make sure that he is following the path of other people in his major. To play up this value, we created a design completely based around this social interaction. However, when asking users what they thought of the idea, they were concerned about everybody having access to their personal schedule without them knowing. This is a feature which we will need to explore more to see if it is worth implementing in the final design.",
"caption":"Design #3: Social Registration",
"url":"portfolio3.JPG"},
{"description":"Trying to make registration less stressful and less clinical, this design uses a dragon mentor to advise a student on what to take for the next semester. Since registration is currently such a negative experience, this design adds a little fun while still giving feedback and support to the student. However, due to the importance of registration, this design was a little too childish for our users, so we have brought the design back to feel more sleek and business-like.",
"caption":"Design #4: Dragon Advisor",
"url":"portfolio4.JPG"},
{"description":"Focusing on the planning side of registration, this design encourages a one-page view of a user’s four-year plan, allowing easy manipulation of courses through dragging and dropping into a “flow” for each semester. Sara would really appreciate seeing all courses in one place, but Francis and Tyler would probably be overwhelmed by this overarching view. We decided to get rid of the four-year view and focus on the single-semester planning experience. We incorporated the basic feel of one semester on this design into our calendar view on the final design.",
"caption":"Design #5: Flow Diagram",
"url":"portfolio5.JPG"},
{"description":"EdX’s course pages let users learn more about classes they are interested in. We adopted this idea in our design by writing detailed course descriptions for each class in the offered in the catalog. Users who are similar to Tyler the Trailblazer value finding the most interesting classes and don’t place as much emphasis on scheduling in major requirements. Course description pages meet this need by telling users more information when they are registering for classes. We directly adopted the course description page in our final design.",
"caption":"Design #6: EdX Style Course Pages",
"url":"portfolio6.JPG"},
{"description":"To portray information as visually as possible, the student’s four-year plan is built as a set of webs, with requirements auto-populated and electives draggable into the design. This focuses on all three of our personas’ needs for the design to be visual and Francis’s need to have a quick and easy way to check if he’s on track. The downside of this design was that there was no way to make it logically condense onto one screen - if it was large enough to read all of the nodes on the web, it would require scrolling, so you couldn’t see the whole path at once; however, if it was small enough so that you could see the entire path at a glance, the nodes (classes) would be too small to read. We decided it was more important that the user have a readable view of next semester than a confusing four-year plan, so we focused on the visual design of that one critical semester (since this is what is most important to all of our users, and the only thing that is important to Tyler and Francis).",
"caption":"Design #7: Semester Graph",
"url":"portfolio7.JPG"},
{"description":"Drawing the focus back to the declared major, this view shows the typical path a student in that major would take and presents the branches between majors to visualize how a student’s passions map to a specific major. This was an interesting idea in that it showed the interplay between the majors (adding flexibility for Tyler) and was a reasonable visualization of the prerequisites of classes (lessening the preparation Francis needs to do before registration). However, it is unclear what the user’s progress is toward graduation and is confusing at a glance, which are needs important to all of our users.",
"caption":"Design #8: Branching Paths",
"url":"portfolio8.JPG"},
{"description":"To take the stress of navigation out of the registration process, this single-page design conveys progress, course catalog, schedule, and suggestions in a readable format. This design meets many of the needs of our users, including Francis seeing that he is on track to graduate and spending little time preparing to register, Tyler having the flexibility to schedule classes that he wants yet still visualize his path, and Sara easily making and understanding her plans. Since this design encompasses so many of our users needs and values, it became the basis for our final design, with features from other designs incorporated into it.",
"caption":"Design #9: One-Page Heavy Info View",
"url":"portfolio9.JPG"},
{"description":"This design let users select more classes than they planned to take and then go through a “checkout” phase to register. In “checkout”, users could see what schedules were possible and select the ideal set of courses for them. In the current registration process, students need to use a tool like Outlook to visualize course conflicts. By “checking out” before they register, students could pick any classes they are interested in and the interface would compute the visual representations, meeting the schedule visualization need of our users. Including a calendar in the paper prototype was well received so we included the visualization feature in our final product.",
"caption":"Design #10: “Checkout,” inspired by Amazon",
"url":"portfolio10.jpg"},
{"description":"This design let users drop classes into different semesters to construct a four year plan. Our users, particularly those who fall into the Sara the Super-Planner category, expressed the need to plan out their schedules using tools like Microsoft Excel. This design aimed to make the process simpler by having a listing of all classes and letting users drag-and-drop classes instead of typing them into boxes. Since the design was more focused around planning instead of registration, we simplified this interface by removing the four-year plan, suggestions, and wish-list.",
"caption":"Design #11: Drag and Drop Course Planner",
"url":"portfolio11.JPG"},
{"description":"This design let users search for classes and easily filter through the results in a similar fashion to Amazon. Many of our users expressed the need to easily find classes and complained that the current system was too hard to search with. A search bar on every page was included in the paper prototype which many users responded to positively. Few users ended up using filters, however, so we kept the search feature and removed the ability to filter results.",
"caption":"Design #12: Search and Filter",
"url":"portfolio12.JPG"}
]