[
{"description":"This comprehensive website spans both the planning and registration spaces. An amalgamation of a few of our other ideas, it provides a suggestions and wishlist space juxtaposed with a calendar to create the planning environment. Emphasis is placed on searching and finding information about classes on a separate page - filters and keywords are used to make sure the user gets exactly the information they are looking for. Upon logging in, the user views a splash page of the specialized courses that will be offered during the next semester; this includes both the special topics classes and the classes that will only be offered once. This type of website addresses many of the needs and values expressed by our users, such as Francis’s need to spend little time preparing for registration (and thus be able to access the information he wants quickly), Tyler’s needs of flexibility and complete autonomy (in the way that the planning section suggests courses but also provides a space for you to add your own interests and values in the “wishlist”), and Sara’s values of thinking ahead and collaboration (since she can use the planning tool to create a four-year plan and then have a clear visual representation to share with others). This design captures most of the expressed needs and values, but was a bit too complicated for what we were aiming to have for registration. Thus, we took many of the elements from this design (such as the calendar and the suggestions of requirements) but simplified the interface to two information-packed but logically-mapped screens.",
"url":"sketch1.JPG",
"caption":"Design #1: Planning and Registering"},
{"description":"This design, pulled from our original portfolio of designs, provides for almost all of our users’ needs and values on a single screen. This one-page view is extremely powerful and visual, and is built to quickly and effectively communicate a course schedule, a student’s progress toward graduation, the courses acquaintances are taking, and what courses are being offered in the next semester. This type of powerful tool is a good avenue for Francis’s needs for little preparation for registration and to know what others are taking, Tyler’s needs of autonomy and sharing his passion, and Sara’s needs to visualize progress and to share plans and get support. The downsides to this design are the density of information and the high-level outlook on the information, since good and clear visualization is prioritized below conveyance of accurate (but overview) information. Thus, some features from this design were given more space and more detailed information in our final design (such as the calendar) and others were taken off the table (like the social aspect, since users during testing were uncomfortable with this perceived invasion of privacy).",
"url":"sketch2.JPG",
"caption":"Design #2: One-Page Heavy Info View"},
{"description":"This graph, basically a set of nodes (representing classes) radiating out from around a central circle (representing the semester), focuses heavily on visual representation of the progress a student is making towards graduation. This plays upon both Sara’s need for a clear visualization and Francis’s desire to know that he is on track. Within this design, Tyler can also visualize the “path” that he is taking through college. This design, however, sacrifices clarity of content to achieve this broad overview, since the user must view it from such a high level to see the four-year plan. Also, when bringing the major goal of this designing (the visualization of the four-year plan) back to our personas, we discovered that both Francis and Tyler were more focused on the next semester to come than the rest of their time at Olin. Thus, even though this design pushed us to think in creative and innovative ways, we pivoted and put more time into developing the interface based around registration for a single semester.",
"url":"sketch3.JPG",
"caption":"Design #3: Semester Graph"}
]