{
	"Problem_Statement": {"topic_name": "Problem Statement",
	"problem_description":"The current course planning and registration system is confusing and stressful for students. The interface is outdated and clunky and adds to the stress of registration. We are going to design an interface that makes designing a four-year plan easier, and will rethink how registration can be simplified in terms of this course plan. The primary users will be students at Olin, though data from students at other universities will also inform our process and decisions. Currently, students are either impartial or downright negative about registration and planning, depending on how much effort they put into it. We will design an interface that is simple, flexible, visual, and customizable to fit the needs of Olin students. The interface will certainly impact those that plan a lot and those that have tried to plan and failed, and we also hope to reach those that currently do not plan because it is too trying. The key problems we want to address are:",
	"key_problems": ["Simplifying the course registration and planning process. Oliners prefer thinking and planning about their future courses over being experts at course registration itself. Therefore, the interface needs to have a quick learning curve, easy visualization of data, and stress-free features like course searching.","Providing useful information to students during course planning and registration so they can make better decisions about which courses they take during a semester","Helping students figure out which classes they need to take based on their academic requirements. Since its hard for students to remember what requirements they have finished and what still needs to be completed, its very challenging to pick courses effectively"]
	},
	"Design_Narrative": {"topic_name": "Design Narrative",
	"narrative": "Sara is a sophomore who recently declared her major as E:Bioengineering. She has crafted her four-year plan carefully since freshman year to take required courses as well as other interesting courses (in multiple subjects) as they become available. On registration day, she opens my.olin.edu, inputs the course numbers for her classes, and presses search. The search query fails, and gives a generic error message with no indication of what went wrong. She types the name of the course, “engineered microbial systems,” and again, the query does not work. While Sara was fiddling with the system, the other classes she was planning to take, entrepreneurial initiative and materials science, have filled up. When discussing her schedule with her friends after registration has ended, she discovers that the search function on my.olin.edu defaults to “starts with,” and so she would have had to search for “special topics” instead. The course registration interface not only prevented her from enrolling in the courses she wanted to take, but also caused her to have to completely redo four-year plan because she missed those requirements classes. <br><br> The story of Sara highlights common interface problems found by many Olin students. Sara spent a lot of time planning her courses and should be rewarded for her diligence. When Sara begins the course registration process, however, she is immediately confronted by an interface laden with usability traps such as not having an efficient course searching system and a time-sensitive registration process. Sara has to struggle with the system and is ultimately punished because she is unfamiliar with the sign-up process. This is an extremely frustrating experience because she feels like she is wasting her time wrestling with my.olin.edu and getting unsatisfying results. Moreover, Sara feels like her planning is useless which discourages her from designing her path through Olin. Fixing this problem will remove a lot of stress of students by helping them focus more on picking the correct classes and learning in those courses. <br><br> When designing such an interface it must appeal to students who plan heavily as well as students who pick courses relatively close to the course registration period. This is challenging since these two types of students approach planning and registration in such opposite ways. Additionally, the solution to my.olin.edu will need to account for the needs, values, and goals of other stakeholders such as the registrar and students’ advisors. The system cannot make it harder to plan course timings for each semester and it must be easy to integrate into the pre-existing registration infrastructure."
	},
	"Shortcomings" : {"topic_name": "Methodology Shortcomings",
	"shortcomings": ["We are in our user group so it will be hard to exclude our own internal biases from our designs", "Many students only interract with course registration once per year. Therefore, they might remember their interaction differently from how it actually was."]},
	"Requirements": {"topic_name": "Requirements",
	"key_requirements": ["", "", ""]},
	"Impact": {"topic_name": "Impact",
	"impacts":[{"impact_title": "Enjoyment over stress.",
	 "impact_description":"When students think of registration, they will think of the enjoyment choosing courses rather than how hard it is to choose those courses."}, 
	 {"impact_title": "Facilitating and rewarding planning.",
	 "impact_description":"By creating a registration system which rewards planning, students will feel more in control over their academic careers, improving graduation rates and satisfaction with courses."}, 
	 {"impact_title": "Increase visualization.",
	 "impact_description":"By increasing the ability of the students to visualize their four-year plans, students will be less likely to miss a requirement and more willing to get feedback on their schedule from others."}, 
	 {"impact_title": "Promoting self-directed learning.",
	 "impact_description":"By making it easier for students to plan electives into their schedules, the new system will encourage students to incorporate a wider variety of courses into their education and promote a sense of agency and self-actualization"}]},
	 "Data_Gathering": {"topic_name": "Data Gathering",
	 "process":"To better understand our users, we conducted a series of interviews of them and other stakeholders.  We interviewed 21 people in total, including students from Olin and Babson colleges, professors at Olin, and the Olin registrar.  Our target audience is Olin students, but we thought that the opinions from other students about their registration systems would better inform our process and give us new insights into how to make our registration and planning system better.  We found out that Babson uses purportedly better system for registration, which we will be exploring in more detail in the future. <br><br> During our interviews, we asked a series of pre-prepared questions but also let the interviewee guide the interviews if they so desired.  Examples of questions we asked surrounded current course planning, feelings about registration and the current system, roles of advisors, and adjectives to describe an ideal interaction with the registration/planning system.  We also asked to see the way that students were currently planning out their schedules or preparing for registration.  When interviewing faculty members, we asked about their relationships with their advisees and about their personal interactions with the my.olin.edu system.  Similar questions were asked of the registrar.",
	 "insights":["Students never reacted to our questions about the current system in a positive way.  All responses were either neutral (“I guess it works okay…”) to negative (“I hate it!  I can’t figure out how to use it!”) ",
	 "Students fell into three major categories around planning: those who liked to plan, those who tried and failed to plan, and those who avoided planning.",
	 "Advisors were either very involved in the planning of their advisee’s schedule or completely hands off.  Students generally wanted one of these extremes, and would switch to another advisor based on this type of advising (or to an advisor who understood their specific major better).",
	 "Students either tend to take requirements first to open up their schedules later on for electives, or prioritize electives from the beginning and end up taking requirements late in their college careers (to the dismay of their advisors).",
	 "Students and faculty alike are confused and frustrated by the current system.  The unhelpful error messages, confusing tree-like organization, and bad search feature were among the most-quoted difficulties.",
	 "Students like the notion of a portal being a source for all Olin knowledge. We should avoid designs which try to bundle unrelated functions together.",
	 "Students enjoy picking their classes so it’s important to keep a sense of autonomy in the course registration process. This means that we should deliberately avoid AI based algorithms for picking classes because such an algorithm would be unnecessary and could even negatively impact our users."
	 ],
	 "quotes":["“I just hope I get lucky” [in terms of how a student plans for how to get the classes she wants]",
	 "“[Course registration is] not very intuitive…”",
	 "“[My major] is stupid!  I can’t ever tell when any of the classes will be offered again, so I have to take them now and they mess up my plan!”",
	 "“I just copy and paste as fast as I can” [in response to how she registers]",
	 "“I know this will work somehow” [in response to his feelings on registration]",
	 "“How does this go again???” [in response to our question to lead us through the registration process]",
	 "“That was terrible” [in response to trying to sign up for a class]",
	 "“I have to poke around everywhere to do anything” [when trying to navigate my.olin.edu]",
	 "“At least I know the six places to look now” [sarcastically talking about my.olin.edu navigation]",
	 "“The portal [my.olin.edu] is not my go-to place for anything”",
	 "“I think it’s honestly stupid the way they do it [registration] now”"
	 ],
	 "imageUrl":"2x2.JPG",
	 "imageCaption":"Matrix Representing User's Traits Derived From Interviews"
	 },
	"Task_Analysis": {"topic_name": "Task Analysis",
	"activityFlowUrl":"UsersActivityFlow.png",
	"taskFlowUrl":"Taskflow.png"},
	"Personas": {"topic_name": "Personas"}
}